z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
#include <assert.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "transport_core.h"
#include "nrf24_regs.h"

static uint8_t fake_status;
static uint8_t fake_rx_payload[NRF24_MAX_PAYLOAD];
static bool fake_rx_ready;
static uint8_t captured_tx[NRF24_MAX_PAYLOAD];
static uint8_t fake_tx_fifo[3][NRF24_MAX_PAYLOAD];
static uint8_t fake_tx_read, fake_tx_count;
static unsigned fake_tx_flush_count;
static uint8_t captured_address[NRF24_ADDR_LEN];
static uint8_t captured_rx_address[6][NRF24_ADDR_LEN];
static uint8_t captured_rx_open;
static unsigned captured_tx_count;
static uint32_t fake_now;
static bool fake_rx_mode;
static bool fake_ce;

static uint32_t crc32_update(uint32_t crc, const uint8_t *data, size_t length) {
    size_t i;
    crc ^= 0xffffffffu;
    for (i = 0; i < length; ++i) {
        uint8_t bit;
        crc ^= data[i];
        for (bit = 0; bit < 8; ++bit) {
            uint32_t mask = 0u - (crc & 1u);
            crc = (crc >> 1) ^ (0xedb88320u & mask);
        }
    }
    return crc ^ 0xffffffffu;
}

static void make_packet(uint8_t *packet, const uint8_t network[4],
        uint8_t type, uint8_t source, uint8_t destination, uint8_t id,
        uint8_t flags, const uint8_t *payload, size_t length) {
    uint32_t crc;
    memset(packet, 0, NRF24_MAX_PAYLOAD);
    packet[0] = TRANSPORT_WIRE_PROTOCOL_ID | type;
    packet[1] = source;
    packet[2] = destination;
    packet[3] = id;
    packet[4] = flags | (uint8_t)length;
    if (length != 0) memcpy(packet + TRANSPORT_WIRE_HEADER_SIZE, payload, length);
    crc = crc32_update(0, network, 4);
    crc = crc32_update(crc, packet, TRANSPORT_WIRE_HEADER_SIZE);
    crc = crc32_update(crc, packet + TRANSPORT_WIRE_HEADER_SIZE, length);
    packet[TRANSPORT_WIRE_HEADER_SIZE + length] = (uint8_t)crc;
}

static void make_cts(uint8_t *packet, const uint8_t network[4],
        uint8_t source, uint8_t destination, uint8_t id,
        uint8_t original_type, uint8_t result, uint32_t value) {
    uint8_t payload[6];
    payload[0] = original_type;
    payload[1] = result;
    payload[2] = (uint8_t)value;
    payload[3] = (uint8_t)(value >> 8);
    payload[4] = (uint8_t)(value >> 16);
    payload[5] = (uint8_t)(value >> 24);
    make_packet(packet, network, TRANSPORT_WIRE_CTS, source, destination, id,
        TRANSPORT_WIRE_LAST_PACKET, payload, sizeof(payload));
}

static uint32_t ticks_ms(void *context) {
    (void)context;
    return fake_now;
}

static bool irq_is_low(void *context) {
    (void)context;
    return fake_status != 0;
}

static bool io_ok(void *context) {
    (void)context;
    return true;
}

uint8_t nrf24_read_status(nrf24_t *radio) {
    (void)radio;
    return fake_status;
}

void nrf24_clear_irq(nrf24_t *radio, uint8_t sources) {
    (void)radio;
    fake_status &= (uint8_t)~sources;
}

bool nrf24_rx_fifo_empty(nrf24_t *radio) {
    (void)radio;
    return !fake_rx_ready;
}

bool nrf24_tx_fifo_empty(nrf24_t *radio) {
    (void)radio;
    return fake_tx_count == 0;
}

bool nrf24_tx_fifo_full(nrf24_t *radio) {
    (void)radio;
    return fake_tx_count == 3;
}

bool nrf24_read_payload(nrf24_t *radio, uint8_t *buffer, size_t capacity,
        size_t *length) {
    (void)radio;
    if (!fake_rx_ready || capacity < NRF24_MAX_PAYLOAD) return false;
    memcpy(buffer, fake_rx_payload, NRF24_MAX_PAYLOAD);
    fake_rx_ready = false;
    if (length != NULL) *length = NRF24_MAX_PAYLOAD;
    return true;
}

void nrf24_stop_listening(nrf24_t *radio) {
    (void)radio;
    fake_rx_mode = false;
}

void nrf24_enter_tx_mode(nrf24_t *radio) {
    (void)radio;
    fake_rx_mode = false;
    fake_ce = false;
    fake_status &= (uint8_t)~(NRF24_STATUS_TX_DS | NRF24_STATUS_MAX_RT);
}

void nrf24_enter_rx_mode(nrf24_t *radio) {
    (void)radio;
    fake_rx_mode = true;
    fake_ce = true;
    fake_status &= (uint8_t)~(NRF24_STATUS_TX_DS | NRF24_STATUS_MAX_RT);
}

void nrf24_start_listening(nrf24_t *radio) {
    nrf24_enter_rx_mode(radio);
}

void nrf24_set_ce(nrf24_t *radio, bool high) {
    (void)radio;
    fake_ce = high;
}

void nrf24_open_tx_pipe(nrf24_t *radio, const uint8_t *address) {
    (void)radio;
    memcpy(captured_address, address, sizeof(captured_address));
}

void nrf24_open_rx_pipe(nrf24_t *radio, uint8_t pipe, const uint8_t *address) {
    (void)radio;
    assert(pipe < 6);
    memcpy(captured_rx_address[pipe], address, NRF24_ADDR_LEN);
    captured_rx_open |= (uint8_t)(1u << pipe);
}

void nrf24_close_rx_pipe(nrf24_t *radio, uint8_t pipe) {
    (void)radio;
    assert(pipe < 6);
    captured_rx_open &= (uint8_t)~(1u << pipe);
}

bool nrf24_write_payload(nrf24_t *radio, const uint8_t *buffer, size_t length) {
    (void)radio;
    if (length != NRF24_MAX_PAYLOAD || fake_tx_count == 3) return false;
    if (fake_tx_count == 0) memcpy(captured_tx, buffer, length);
    memcpy(fake_tx_fifo[(fake_tx_read + fake_tx_count) % 3], buffer, length);
    fake_tx_count++;
    captured_tx_count++;
    return true;
}

void nrf24_abort_send(nrf24_t *radio) {
    (void)radio;
    fake_ce = false;
    fake_status = 0;
    fake_tx_read = 0;
    fake_tx_count = 0;
    fake_tx_flush_count++;
}

static void deliver(transport_core_t *core, const uint8_t *packet) {
    memcpy(fake_rx_payload, packet, NRF24_MAX_PAYLOAD);
    fake_rx_ready = true;
    fake_status |= NRF24_STATUS_RX_DR;
    transport_core_on_radio_irq(core);
}

static void ack_tx(transport_core_t *core) {
    assert(core->tx.active);
    assert(fake_tx_count != 0);
    fake_tx_read = (uint8_t)((fake_tx_read + 1) % 3);
    fake_tx_count--;
    if (fake_tx_count != 0) {
        memcpy(captured_tx, fake_tx_fifo[fake_tx_read], NRF24_MAX_PAYLOAD);
    }
    fake_status |= NRF24_STATUS_TX_DS;
    transport_core_on_radio_irq(core);
}

static void ack_then_max_rt(transport_core_t *core) {
    assert(core->tx.active);
    assert(fake_tx_count >= 2);
    fake_tx_read = (uint8_t)((fake_tx_read + 1) % 3);
    fake_tx_count--;
    memcpy(captured_tx, fake_tx_fifo[fake_tx_read], NRF24_MAX_PAYLOAD);
    fake_status |= NRF24_STATUS_TX_DS | NRF24_STATUS_MAX_RT;
    transport_core_on_radio_irq(core);
}

static void send_command_to_receiver(transport_core_t *core,
        const uint8_t network[4], uint8_t id, const uint8_t *data,
        uint16_t length) {
    uint8_t packet[NRF24_MAX_PAYLOAD];
    uint8_t intent[2];
    intent[0] = (uint8_t)length;
    intent[1] = (uint8_t)(length >> 8);
    make_packet(packet, network, TRANSPORT_WIRE_COMMAND, 7, 1, id,
        TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET,
        intent, sizeof(intent));
    deliver(core, packet);
    assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) == TRANSPORT_WIRE_CTS);
    assert(captured_tx[5] == TRANSPORT_WIRE_COMMAND);
    assert(captured_tx[6] == TRANSPORT_CTS_ACCEPTED);
    ack_tx(core);
    make_packet(packet, network, TRANSPORT_WIRE_COMMAND, 7, 1, id,
        TRANSPORT_WIRE_LAST_PACKET, data, length);
    deliver(core, packet);
}

int main(void) {
    transport_core_t core;
    transport_core_config_t config;
    nrf24_t radio;
    uint8_t command_buffer_small[8];
    uint8_t command_buffer_large[64];
    uint8_t pipe_buffers[TRANSPORT_CORE_PIPE_SLOTS][160];
    uint8_t control_buffer[TRANSPORT_CORE_CONTROL_TX_SLOTS * NRF24_MAX_PAYLOAD];
    uint8_t event_buffer[64];
    uint8_t packet[NRF24_MAX_PAYLOAD];
    uint8_t intent[2];
    size_t event_length, required;
    const uint8_t first[] = { 'h', 'e', 'l', 'l', 'o' };
    const uint8_t wrapped[] = { 'w', 'r', 'a', 'p', '!', '!' };
    uint8_t outbound[60];
    uint8_t long_stream[120];
    uint8_t i;

