z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
    assert(core.stats.commands_sent == 2);
    assert(core.stats.commands_failed == 4);

    /* An unbounded restart count is still bounded by the retry window. */
    core.config.max_rt_restarts = TRANSPORT_CORE_RESTARTS_UNBOUNDED;
    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        35, first, sizeof(first)));
    ack_tx(&core);
    make_cts(packet, config.network_id, 9, 1, 35, TRANSPORT_WIRE_COMMAND,
        TRANSPORT_CTS_ACCEPTED, sizeof(first));
    deliver(&core, packet);
    fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
    transport_core_service(&core);
    for (i = 0; i < 5; ++i) {
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(core.tx.active);
    }
    fake_now += config.max_rt_window_ms;
    fake_status |= NRF24_STATUS_MAX_RT;
    transport_core_on_radio_irq(&core);
    assert(!core.tx.active);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) ==
        TRANSPORT_EVENT_COMMAND_FAILED);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) ==
        TRANSPORT_EVENT_CORE_ERROR);
    core.config.max_rt_restarts = config.max_rt_restarts;

    /* Outbound streams reserve the receiver first.  Ring space is released
       as data enters the hardware FIFO, while cumulative credit is committed
       only after that FIFO drains. */
    {
        int pipe_id = transport_core_open_pipe(&core, 9, 40);
        unsigned writes_before_retry;
        assert(pipe_id == 0);
        assert(core.tx.kind == TRANSPORT_TX_CONTROL);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_STREAM);
        assert((captured_tx[4] & TRANSPORT_WIRE_INTENT) != 0);
        assert(transport_core_pipe_tx_write(&core, (uint8_t)pipe_id,
            outbound, 32) == 32);
        assert(!transport_core_send_command(&core, 8,
            TRANSPORT_WIRE_COMMAND, 41, first, sizeof(first)));
        ack_tx(&core);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_TX_WAIT_CTS);

        make_cts(packet, config.network_id, 9, 1, 40,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_ACCEPTED, 32);
        deliver(&core, packet);
        assert(!core.tx.active);
        fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 26);
        assert(memcmp(captured_tx + TRANSPORT_WIRE_HEADER_SIZE, outbound,
            26) == 0);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_OPENED);
        assert((transport_event_get_flags(event_buffer) &
            TRANSPORT_EVENT_FLAG_TX) != 0);
        assert(transport_event_get_value1(event_buffer) == 32);

        writes_before_retry = captured_tx_count;
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(captured_tx_count == writes_before_retry);
        assert(transport_ring_readable(&core.pipes[pipe_id].buffer) == 0);
        ack_tx(&core);
        assert(transport_ring_readable(&core.pipes[pipe_id].buffer) == 0);
        assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 6);
        ack_tx(&core);
        assert(!core.tx.active);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_TX_SPACE);

        assert(transport_core_pipe_tx_write(&core, (uint8_t)pipe_id,
            outbound + 32, 28) == 28);
        assert(!core.tx.active);
        make_cts(packet, config.network_id, 9, 1, 40,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_ACCEPTED, 64);
        deliver(&core, packet);
        assert(!core.tx.active);
        fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 26);
        ack_tx(&core);
        assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 2);
        ack_tx(&core);
        assert(transport_core_close_pipe(&core, (uint8_t)pipe_id));
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 0);
        assert((captured_tx[4] & TRANSPORT_WIRE_LAST_PACKET) != 0);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_TX_SPACE);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_CLOSED);
        assert((transport_event_get_flags(event_buffer) &
            TRANSPORT_EVENT_FLAG_TX) != 0);
        assert(transport_event_get_value0(event_buffer) == sizeof(outbound));
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FREE);
    }

    /* Closing while the final data fragments are still staged must first
       drain the data FIFO.  The terminal packet then starts as a fresh,
       isolated FIFO batch. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        unsigned writes_after_data;
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 47;
        pipe->granted_bytes = sizeof(outbound);
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + config.pipe_lease_ms;

        assert(transport_core_pipe_tx_write(&core, 1, outbound,
            sizeof(outbound)) == sizeof(outbound));
        assert(fake_tx_count == 3);
        writes_after_data = captured_tx_count;
        assert(transport_core_close_pipe(&core, 1));
        assert(captured_tx_count == writes_after_data);
        assert(core.tx.active);
        ack_tx(&core);
        assert(core.tx.drain_requested);
        assert(fake_tx_count == 2);
        assert(captured_tx_count == writes_after_data);
        assert(core.tx.active);
        ack_tx(&core);
        assert(fake_tx_count == 1);
        assert(captured_tx_count == writes_after_data);
        assert(core.tx.active);
        ack_tx(&core);
        assert(fake_tx_count == 1);
        assert(captured_tx_count == writes_after_data + 1);
        assert((captured_tx[4] & TRANSPORT_WIRE_LAST_PACKET) != 0);
        assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 0);
        assert(core.tx.active);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_TX_SPACE);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_CLOSED);
        assert(transport_event_get_value0(event_buffer) == sizeof(outbound));
    }

