z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
    /* A live pipe keeps the three-entry FIFO full.  A command to another
       peer requests draining, owns the FIFO next, and the pipe then resumes. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        unsigned writes_before_refill;
        bool saw_command_sent = false, saw_pipe_closed = false;
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 44;
        pipe->granted_bytes = sizeof(long_stream);
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + config.pipe_lease_ms;

        assert(transport_core_pipe_tx_write(&core, 1, long_stream,
            sizeof(long_stream)) == sizeof(long_stream));
        assert(core.tx.kind == TRANSPORT_TX_PIPE && fake_tx_count == 3);
        assert(transport_ring_readable(&pipe->buffer) ==
            sizeof(long_stream) - 3 * TRANSPORT_WIRE_MAX_DATA);
        writes_before_refill = captured_tx_count;
        ack_tx(&core);
        assert(fake_tx_count == 3);
        assert(captured_tx_count == writes_before_refill + 1);
        assert(transport_ring_readable(&pipe->buffer) ==
            sizeof(long_stream) - 4 * TRANSPORT_WIRE_MAX_DATA);

        assert(transport_core_send_command(&core, 8,
            TRANSPORT_WIRE_COMMAND, 44, first, sizeof(first)));
        assert(core.tx.kind == TRANSPORT_TX_PIPE && core.tx.drain_requested);
        ack_tx(&core);
        ack_tx(&core);
        ack_tx(&core);
        assert(core.tx.kind == TRANSPORT_TX_CONTROL);
        assert(captured_address[0] == 8);
        ack_tx(&core);
        assert(core.commands[0].state == TRANSPORT_COMMAND_TX_WAIT_CTS);
        assert(fake_rx_mode);

        make_cts(packet, config.network_id, 8, 1, 44,
            TRANSPORT_WIRE_COMMAND, TRANSPORT_CTS_ACCEPTED, sizeof(first));
        deliver(&core, packet);
        fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_COMMAND);
        assert(captured_address[0] == 8);
        ack_tx(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert(captured_address[0] == 9);
        ack_tx(&core);
        assert(pipe->transferred_bytes == sizeof(long_stream));
        assert(transport_core_close_pipe(&core, 1));
        ack_tx(&core);

        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
            if (transport_event_get_type(event_buffer) ==
                    TRANSPORT_EVENT_COMMAND_SENT) saw_command_sent = true;
            if (transport_event_get_type(event_buffer) ==
                    TRANSPORT_EVENT_PIPE_CLOSED) saw_pipe_closed = true;
        }
        assert(saw_command_sent && saw_pipe_closed);
        assert(core.pipes[1].state == TRANSPORT_PIPE_FREE);
    }

    {
        int pipe_id = transport_core_open_pipe(&core, 9, 42);
        assert(pipe_id == 0);
        ack_tx(&core);
        make_cts(packet, config.network_id, 9, 1, 42,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_BUSY, 0);
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_CTS_BASE + TRANSPORT_CTS_BUSY);
    }

    /* Reading a live RX stream replenishes cumulative credit only after the
       current grant is exhausted, avoiding a half-duplex turnaround while
       the sender can still be transmitting. */
    make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1, 43,
        TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
    deliver(&core, packet);
    ack_tx(&core);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) ==
        TRANSPORT_EVENT_PIPE_OPENED);
    make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1, 43,
        0, outbound, 26);
    deliver(&core, packet);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) ==
        TRANSPORT_EVENT_PIPE_RX_DATA);
    assert(!core.tx.active);
    make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1, 43,
        0, outbound + 26, 6);
    deliver(&core, packet);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) ==
        TRANSPORT_EVENT_PIPE_RX_DATA);
    assert(core.tx.kind == TRANSPORT_TX_CONTROL);
    assert(captured_tx[5] == TRANSPORT_WIRE_STREAM);
    assert(captured_tx[6] == TRANSPORT_CTS_ACCEPTED);
    assert(captured_tx[7] == 64 && captured_tx[8] == 0);
    ack_tx(&core);
    make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1, 43,
        TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
    deliver(&core, packet);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) ==
        TRANSPORT_EVENT_PIPE_CLOSED);

    /* A terminal RX event must survive temporary event-queue saturation.
       Once foreground polling frees one descriptor, service retries it. */
    {
        transport_event_fields_t filler;
        uint32_t overflows_before;
        memset(&filler, 0, sizeof(filler));
        filler.type = TRANSPORT_EVENT_CORE_ERROR;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            46, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_OPENED);
        for (i = 0; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_emit(&core, &filler));
        }
        overflows_before = core.stats.event_queue_overflows;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            46, TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert(core.pipes[0].state == TRANSPORT_PIPE_CLOSED);
        assert(core.pipes[0].close_event_pending);
        assert(core.stats.event_queue_overflows > overflows_before);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);
        transport_core_service(&core);
        assert(!core.pipes[0].close_event_pending);
        for (i = 1; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT);
            assert(transport_event_get_type(event_buffer) ==
                TRANSPORT_EVENT_CORE_ERROR);
        }
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_CLOSED);
        assert(core.pipes[0].state == TRANSPORT_PIPE_FREE);
    }

    {
        int pipe_id = transport_core_open_pipe(&core, 9, 44);
        assert(pipe_id == 0);
        ack_tx(&core);
        fake_now += config.pipe_lease_ms;
        transport_core_service(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_TIMEOUT);
    }

