z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
    /* An accepted outbound stream must retain an idle lease.  Otherwise a
       vanished application can leave the slot allocated forever.  Its
       failure event must also survive a temporarily full event queue. */
    {
        int pipe_id = transport_core_open_pipe(&core, 9, 45);
        transport_event_fields_t filler;
        assert(pipe_id == 0);
        ack_tx(&core);
        make_cts(packet, config.network_id, 9, 1, 45,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_ACCEPTED, 32);
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_OPENED);
        assert(transport_core_pipe_tx_write(&core, (uint8_t)pipe_id,
            outbound, 10) == 10);
        fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_TX_SPACE);
        memset(&filler, 0, sizeof(filler));
        filler.type = TRANSPORT_EVENT_CORE_ERROR;
        for (i = 0; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_emit(&core, &filler));
        }
        fake_now += config.pipe_lease_ms;
        transport_core_service(&core);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FAILED);
        assert(core.pipes[pipe_id].close_event_pending);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);
        transport_core_service(&core);
        assert(!core.pipes[pipe_id].close_event_pending);
        for (i = 1; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT);
            assert(transport_event_get_type(event_buffer) ==
                TRANSPORT_EVENT_CORE_ERROR);
        }
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_TIMEOUT);
        assert(transport_event_get_value1(event_buffer) == 10);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FREE);
    }

    assert(core.stats.pipes_opened == 5);
    assert(core.stats.pipes_closed == 6);
    assert(core.stats.pipes_failed == 3);

    /* A continuously supplied pipe drains at the fairness deadline, remains
       in RX for the configured dwell, and then resumes the same ring. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 45;
        pipe->granted_bytes = sizeof(long_stream);
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + config.pipe_lease_ms;
        assert(transport_core_pipe_tx_write(&core, 1, long_stream,
            sizeof(long_stream)) == sizeof(long_stream));
        assert(fake_tx_count == 3);

        fake_now += TRANSPORT_CORE_DEFAULT_MAX_CONTINUOUS_TX_MS;
        ack_tx(&core);
        assert(core.radio_phase == TRANSPORT_RADIO_TX_DRAINING);
        assert(transport_ring_readable(&pipe->buffer) ==
            sizeof(long_stream) - 3 * TRANSPORT_WIRE_MAX_DATA);
        ack_tx(&core);
        ack_tx(&core);
        assert(core.radio_phase == TRANSPORT_RADIO_RX_YIELD);
        assert(fake_rx_mode && !core.tx.active);

        fake_now += TRANSPORT_CORE_DEFAULT_FORCED_RX_MS - 1;
        transport_core_service(&core);
        assert(core.radio_phase == TRANSPORT_RADIO_RX_YIELD);
        fake_now++;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert(fake_tx_count == 2);
        ack_tx(&core);
        ack_tx(&core);
        assert(pipe->transferred_bytes == sizeof(long_stream));
        assert(fake_rx_mode && !core.tx.active);
        assert(transport_core_close_pipe(&core, 1));
        ack_tx(&core);
        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
        }
        assert(core.pipes[1].state == TRANSPORT_PIPE_FREE);
    }

    /* Registration datagrams use explicit RF addresses while preserving the
       logical source/destination fields used by Python registration policy. */
    {
        const uint8_t uuid[8] = { 1, 2, 3, 4, 5, 6, 7, 8 };
        uint8_t assignment[9] = { 1, 2, 3, 4, 5, 6, 7, 8, 5 };
        const uint8_t temporary[NRF24_ADDR_LEN] =
            { 0x91, 0x82, 0x73, 0x64, 0x55 };
        uint8_t registration[NRF24_ADDR_LEN];
        uint8_t master_address[NRF24_ADDR_LEN];
        uint32_t protocol_before;

        registration[0] = TRANSPORT_CORE_INVALID_ID;
        master_address[0] = 0;
        memcpy(registration + 1, config.network_id, 4);
        memcpy(master_address + 1, config.network_id, 4);

        transport_core_stop(&core);
        config.node_id = 0;
        config.has_service_address = false;
        transport_core_init(&core, &config);
        assert(transport_core_attach_command_buffer(&core, 0,
            command_buffer_small, sizeof(command_buffer_small)));
        assert(transport_core_attach_command_buffer(&core, 1,
            command_buffer_large, sizeof(command_buffer_large)));
        for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
            assert(transport_core_attach_pipe_buffer(&core, i,
                pipe_buffers[i], i == 0 ? 32 : sizeof(pipe_buffers[i])));
        }
        assert(transport_core_attach_control_tx_buffer(&core, control_buffer,
            sizeof(control_buffer)));
        captured_rx_open = 0;
        assert(transport_core_start(&core));
        assert((captured_rx_open & (1u << 1)) != 0);
        assert((captured_rx_open & (1u << 2)) != 0);
        assert(memcmp(captured_rx_address[1], master_address,
            NRF24_ADDR_LEN) == 0);
        assert(memcmp(captured_rx_address[2], registration,
            NRF24_ADDR_LEN) == 0);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_HELLO,
            TRANSPORT_CORE_INVALID_ID, 0, 50,
            TRANSPORT_WIRE_LAST_PACKET, uuid, sizeof(uuid));
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_RECEIVED);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_HELLO);
        assert(transport_event_get_source_id(event_buffer) ==
            TRANSPORT_CORE_INVALID_ID);
        assert(transport_event_get_transaction_id(event_buffer) == 50);
        assert(transport_event_get_value0(event_buffer) == 0);
        assert(transport_event_get_data_length(event_buffer) == sizeof(uuid));
        assert(memcmp(transport_event_get_data(event_buffer), uuid,
            sizeof(uuid)) == 0);

        protocol_before = core.stats.protocol_errors;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_HELLO,
            TRANSPORT_CORE_INVALID_ID, 0, 51,
            TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET,
            uuid, sizeof(uuid));
        deliver(&core, packet);
        assert(core.stats.protocol_errors == protocol_before + 1);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EMPTY);

        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_ASSIGN, TRANSPORT_CORE_INVALID_ID, 52,
            temporary, assignment, sizeof(assignment)));
        assert(!transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_ASSIGN, TRANSPORT_CORE_INVALID_ID, 53,
            temporary, assignment, sizeof(assignment)));
        assert(core.tx.kind == TRANSPORT_TX_REGISTRATION);
        assert(memcmp(captured_address, temporary, NRF24_ADDR_LEN) == 0);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_ENUM_ASSIGN);
        assert(captured_tx[1] == 0 &&
            captured_tx[2] == TRANSPORT_CORE_INVALID_ID);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_SENT);
        assert((transport_event_get_flags(event_buffer) &
            TRANSPORT_EVENT_FLAG_TX) != 0);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_ASSIGN);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_CONFIRM,
            5, 0, 54, TRANSPORT_WIRE_LAST_PACKET,
            assignment, sizeof(assignment));
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_RECEIVED);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_CONFIRM);

        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_ASSIGN, TRANSPORT_CORE_INVALID_ID, 55,
            temporary, assignment, sizeof(assignment)));
        for (i = 0; i < config.max_rt_restarts; ++i) {
            fake_status |= NRF24_STATUS_MAX_RT;
            transport_core_on_radio_irq(&core);
            assert(core.registration_tx.pending);
        }
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(!core.registration_tx.pending);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_FAILED);
        assert(transport_event_get_value1(event_buffer) ==
            TRANSPORT_REGISTRATION_FAILURE_RADIO);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);

        transport_core_stop(&core);
        config.node_id = TRANSPORT_CORE_INVALID_ID;
        memcpy(config.service_address, temporary, NRF24_ADDR_LEN);
        config.has_service_address = true;
        transport_core_init(&core, &config);
        assert(transport_core_attach_command_buffer(&core, 0,
            command_buffer_small, sizeof(command_buffer_small)));
        assert(transport_core_attach_command_buffer(&core, 1,
            command_buffer_large, sizeof(command_buffer_large)));
        for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
            assert(transport_core_attach_pipe_buffer(&core, i,
                pipe_buffers[i], i == 0 ? 32 : sizeof(pipe_buffers[i])));
        }
        assert(transport_core_attach_control_tx_buffer(&core, control_buffer,
            sizeof(control_buffer)));
        captured_rx_open = 0;
        assert(transport_core_start(&core));
        assert(captured_rx_open == (1u << 1));
        assert(memcmp(captured_rx_address[1], temporary,
            NRF24_ADDR_LEN) == 0);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_ASSIGN,
            0, TRANSPORT_CORE_INVALID_ID, 56,
            TRANSPORT_WIRE_LAST_PACKET, assignment, sizeof(assignment));
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_RECEIVED);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_ASSIGN);
        assert(transport_core_set_node_id(&core, 5));
        master_address[0] = 5;
        assert(memcmp(captured_rx_address[1], master_address,
            NRF24_ADDR_LEN) == 0);

        master_address[0] = 0;
        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_CONFIRM, 0, 57, master_address,
            assignment, sizeof(assignment)));
        assert(!transport_core_set_node_id(&core,
            TRANSPORT_CORE_INVALID_ID));
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_SENT);
        assert(transport_core_set_node_id(&core,
            TRANSPORT_CORE_INVALID_ID));
        assert(memcmp(captured_rx_address[1], temporary,
            NRF24_ADDR_LEN) == 0);
        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_HELLO, 0, 58, registration,
            uuid, sizeof(uuid)));
        assert(memcmp(captured_address, registration, NRF24_ADDR_LEN) == 0);
        assert(captured_tx[1] == TRANSPORT_CORE_INVALID_ID &&
            captured_tx[2] == 0);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_SENT);
    }

    puts("host transport core tests passed");
    return 0;
}
